Revit 2027 API
BuiltInFailures.FamilyFailures.InvalidSlantedColumnOffsetsInNestedFamily Property
 Instance of family [Family Name] can't be updated because in nested family the column's base (Base Level + Base Offset) must be below its top (Top Level + Top Offset).
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId InvalidSlantedColumnOffsetsInNestedFamily { get; }
Public Shared ReadOnly Property InvalidSlantedColumnOffsetsInNestedFamily As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ InvalidSlantedColumnOffsetsInNestedFamily {
	FailureDefinitionId^ get ();
}
static member InvalidSlantedColumnOffsetsInNestedFamily : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.FamilyFailures Class
Autodesk.Revit.DB Namespace